;;; lea と mov の違いデモ
section .data
codes:
    db '0123456789ABCDEF'    ; 16バイト文字列

section .bss
buffer: resq 1               ; rsi に値を見やすく出す用バッファ

section .text
global _start

_start:
    ;-----------------------------------------
    ; mov rsi, codes → rsi に “アドレス値” が入る
    ;-----------------------------------------
    mov rsi, codes        ; rsi = アドレスそのもの
    ; これを write で表示しても文字は出ない（数値だから）

    ;-----------------------------------------
    ; mov rsi, [codes] → メモリ内容（8バイト）を読む
    ;-----------------------------------------
    mov rsi, [codes]      ; '0'〜'7' の8バイトが整数として入る

    ;-----------------------------------------
    ; lea rsi, [codes] → codes のアドレス（mov と同じ）
    ;-----------------------------------------
    lea rsi, [codes]

    ;-----------------------------------------
    ; mov rsi, [codes + rax]
    ;-----------------------------------------
    mov rax, 5
    mov rsi, [codes + rax] ; '5'〜 の8バイトを rsi に読む

    ;-----------------------------------------
    ; lea rsi, [codes + rax] → address計算だけ
    ;-----------------------------------------
    mov rax, 5
    lea rsi, [codes + rax] ; rsi = &codes[5] つまり '5' のアドレス


    ; exit
    mov rax, 60
    xor rdi, rdi
    syscall